<style  type="text/css"> 
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111-002/V002 (Spring 2023)<br>Introduction to Databases
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
hw4: All Tracks<br>
</span>
</center></i><br><br>

# Overview

- There are two parts to hw4:
    - Written questions
    - A common set of practical tasks for both the programming and non-programming tracks.
    


It has the following tasks:


1. Create a new schema ```<uni>_S22_classic_models_star.``` Replace ```<uni>``` with your UNI.<br><br>
2. You will create a [star schema](https://en.wikipedia.org/wiki/Star_schema) using the data from your Classic Models database.
    - The fact in the fact table is of the form ```(productCode, quantityPrders, priceEach, orderedData, customerNumber).```
    - The dimensions are:
        - ```date_dimension: year, quarter, month, day of the month.```
        - ```location_dimension: region, country, city.``` The zip file contain a file ```country_region.csv``` that provides the mapping of countries to regions.
        - ```product_dimension: product_scale, product_line, product_vendor.```<br><br>
3. You will write queries that demonstrate:
    - A slice of the data.
    - A dice of the data.
    - A drill-down.
    - A roll-up.
    
    
- The homework is due on ```2022-MAY-04``` at 11:59 PM. We will post detailed submission instructions on Ed and Gradescope. Your submission format will be PDF and zip copies of this notebook. You must name your files following the instructions we publish.

# Setup

In [1]:
import pandas as pd

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:1020suxinfu@localhost

In [4]:
country_region = pd.read_csv('./country_region.csv')

In [5]:
country_region

         Country Region
0         France   EMEA
1            USA    NaN
2      Australia   APAC
3         Norway   EMEA
4         Poland   EMEA
5        Germany   EMEA
6          Spain   EMEA
7         Sweden   EMEA
8        Denmark   EMEA
9      Singapore   APAC
10      Portugal   EMEA
11         Japan   APAC
12       Finland   EMEA
13            UK   EMEA
14       Ireland   EMEA
15        Canada    NaN
16     Hong Kong   APAC
17         Italy   EMEA
18   Switzerland   EMEA
19   Netherlands   EMEA
20       Belgium   EMEA
21   New Zealand   APAC
22  South Africa   EMEA
23       Austria   APAC
24   Philippines   APAC
25        Russia   EMEA
26        Israel   EMEA

# Schema

- Execute your SQL statements for creating the schema, table and constraints for the fact and dimension tables in the following cells.

In [6]:
%%sql

create schema if not exists xs2444_S22_classic_models_star;
Use xs2444_S22_classic_models_star;
create table if not exists product_dimension
(
    productCode    varchar(15) not null,
    product_scale  varchar(10) null,
    product_line   varchar(50) null,
    product_vendor varchar(50) null,
    constraint product_dimension_pk
        primary key (productCode)
);

create table if not exists xs2444_S22_classic_models_star.date_dimension
(
    orderDate            date not null
        primary key,
    year                 int  null,
    quarter              int  null,
    month                int  null,
    day_of_month         varchar(10)
);

create table if not exists xs2444_S22_classic_models_star.csv
(
    country varchar(15) not null,
    region  varchar(15) null
);

create table if not exists xs2444_S22_classic_models_star.fact
(
    productCode     varchar(15)    not null,
    quantityOrdered int            null,
    priceEach       decimal(10, 2) null,
    orderDate       date           not null,
    customerNumber  int            not null,
    primary key (productCode, orderDate, customerNumber),
    constraint fact_date_dimension_orderDate_fk
        foreign key (orderDate) references date_dimension (orderDate),
    constraint fact_product_dimension_productCode_fk
        foreign key (productCode) references product_dimension (productCode)
);

create table if not exists xs2444_S22_classic_models_star.location_dimension
(
    customerNumber int         not null
        primary key,
    region         varchar(20) null,
    country        varchar(15) null,
    city           varchar(20) null,
    constraint location_dimension_customers_customerNumber_fk
        foreign key (customerNumber) references classicmodels.customers (customerNumber)
);

 * mysql+pymysql://root:***@localhost
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

# Data Loading

- Enter and execute your SQL for loading the data into the facts and dimensions table. The source of the information is the Classic Models data.

In [7]:
%%sql 
use xs2444_S22_classic_models_star;

insert into xs2444_S22_classic_models_star.product_dimension (productCode, product_scale, product_line, product_vendor)
select distinct (productCode), productScale, productLine, productVendor from classicmodels.products;

select * from product_dimension order by productCode limit 10;

 * mysql+pymysql://root:***@localhost
0 rows affected.
110 rows affected.
10 rows affected.

[('S10_1678', '1:10', 'Motorcycles', 'Min Lin Diecast'),
 ('S10_1949', '1:10', 'Classic Cars', 'Classic Metal Creations'),
 ('S10_2016', '1:10', 'Motorcycles', 'Highway 66 Mini Classics'),
 ('S10_4698', '1:10', 'Motorcycles', 'Red Start Diecast'),
 ('S10_4757', '1:10', 'Classic Cars', 'Motor City Art Classics'),
 ('S10_4962', '1:10', 'Classic Cars', 'Second Gear Diecast'),
 ('S12_1099', '1:12', 'Classic Cars', 'Autoart Studio Design'),
 ('S12_1108', '1:12', 'Classic Cars', 'Second Gear Diecast'),
 ('S12_1666', '1:12', 'Trucks and Buses', 'Welly Diecast Productions'),
 ('S12_2823', '1:12', 'Motorcycles', 'Unimax Art Galleries')]

In [8]:
%%sql 
insert into xs2444_S22_classic_models_star.location_dimension select customerNumber, region, country, city from 
xs2444_S22_classic_models_star.csv join classicmodels.customers using (country);

select * from location_dimension order by customerNumber limit 10;

 * mysql+pymysql://root:***@localhost
120 rows affected.
10 rows affected.

[(103, 'EMEA', 'France', 'Nantes'),
 (112, 'NA', 'USA', 'Las Vegas'),
 (114, 'APAC', 'Australia', 'Melbourne'),
 (119, 'EMEA', 'France', 'Nantes'),
 (121, 'EMEA', 'Norway', 'Stavern'),
 (124, 'NA', 'USA', 'San Rafael'),
 (125, 'EMEA', 'Poland', 'Warszawa'),
 (128, 'EMEA', 'Germany', 'Frankfurt'),
 (129, 'NA', 'USA', 'San Francisco'),
 (131, 'NA', 'USA', 'NYC')]

In [9]:
%%sql 
insert xs2444_S22_classic_models_star.date_dimension
select distinct(orderDate) as orderDate, year(orderDate) as year, quarter(orderDate) as quarter, month(orderDate) as 
month, dayofmonth(orderDate) as day_of_the_month from classicmodels.orders;

select * from xs2444_S22_classic_models_star.date_dimension limit 10;

 * mysql+pymysql://root:***@localhost
265 rows affected.
10 rows affected.

[(datetime.date(2003, 1, 6), 2003, 1, 1, '6'),
 (datetime.date(2003, 1, 9), 2003, 1, 1, '9'),
 (datetime.date(2003, 1, 10), 2003, 1, 1, '10'),
 (datetime.date(2003, 1, 29), 2003, 1, 1, '29'),
 (datetime.date(2003, 1, 31), 2003, 1, 1, '31'),
 (datetime.date(2003, 2, 11), 2003, 1, 2, '11'),
 (datetime.date(2003, 2, 17), 2003, 1, 2, '17'),
 (datetime.date(2003, 2, 24), 2003, 1, 2, '24'),
 (datetime.date(2003, 3, 3), 2003, 1, 3, '3'),
 (datetime.date(2003, 3, 10), 2003, 1, 3, '10')]

In [10]:
%%sql 
USE classicmodels;

insert into xs2444_S22_classic_models_star.fact (productCode, quantityOrdered, priceEach, orderDate, customerNumber) 
    with a as (
    select * from products join orderdetails using(productCode)
    ),
b as (
    select * from a join orders using (orderNumber)
    ),
c as (
    select * from b join customers using(customerNumber)
)
select productCode, quantityOrdered, priceEach, orderDate, customerNumber from c;

use xs2444_S22_classic_models_star;

select * from fact limit 10

 * mysql+pymysql://root:***@localhost
0 rows affected.
2996 rows affected.
0 rows affected.
10 rows affected.

[('S10_1678', 30, Decimal('81.35'), datetime.date(2003, 2, 24), 131),
 ('S10_1678', 34, Decimal('86.13'), datetime.date(2003, 5, 7), 353),
 ('S10_1678', 41, Decimal('90.92'), datetime.date(2003, 7, 1), 250),
 ('S10_1678', 45, Decimal('76.56'), datetime.date(2003, 8, 25), 205),
 ('S10_1678', 49, Decimal('81.35'), datetime.date(2003, 10, 10), 321),
 ('S10_1678', 36, Decimal('94.74'), datetime.date(2003, 10, 28), 161),
 ('S10_1678', 29, Decimal('76.56'), datetime.date(2003, 11, 11), 171),
 ('S10_1678', 48, Decimal('95.70'), datetime.date(2003, 11, 18), 167),
 ('S10_1678', 22, Decimal('82.30'), datetime.date(2003, 12, 1), 129),
 ('S10_1678', 41, Decimal('90.92'), datetime.date(2004, 1, 15), 406)]

# Queries

- In each of the sections below, define what your query is producing, provide the query and execute to produce the results.

## Slice

Explanation: We would like to know sale facts of all products sold in 2003.

In [11]:
%%sql
use xs2444_S22_classic_models_star;
select * from 
    fact join date_dimension using (orderDate) where year='2003' limit 10

 * mysql+pymysql://root:***@localhost
0 rows affected.
10 rows affected.

[(datetime.date(2003, 1, 6), 'S18_1749', 30, Decimal('136.00'), 363, 2003, 1, 1, '6'),
 (datetime.date(2003, 1, 6), 'S18_2248', 50, Decimal('55.09'), 363, 2003, 1, 1, '6'),
 (datetime.date(2003, 1, 6), 'S18_4409', 22, Decimal('75.46'), 363, 2003, 1, 1, '6'),
 (datetime.date(2003, 1, 6), 'S24_3969', 49, Decimal('35.29'), 363, 2003, 1, 1, '6'),
 (datetime.date(2003, 1, 9), 'S18_2325', 25, Decimal('108.06'), 128, 2003, 1, 1, '9'),
 (datetime.date(2003, 1, 9), 'S18_2795', 26, Decimal('167.06'), 128, 2003, 1, 1, '9'),
 (datetime.date(2003, 1, 9), 'S24_1937', 45, Decimal('32.53'), 128, 2003, 1, 1, '9'),
 (datetime.date(2003, 1, 9), 'S24_2022', 46, Decimal('44.35'), 128, 2003, 1, 1, '9'),
 (datetime.date(2003, 1, 10), 'S18_1342', 39, Decimal('95.55'), 181, 2003, 1, 1, '10'),
 (datetime.date(2003, 1, 10), 'S18_1367', 41, Decimal('43.13'), 181, 2003, 1, 1, '10')]

## Dice

Explanation: We would like know sale facts of all products sold on 2003 and the products should be sold in France

In [12]:
%%sql
select * from
    (select * from fact join date_dimension using (orderDate) where year='2003') as a 
    join 
    location_dimension using(customerNumber) where country = 'France' limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(172, datetime.date(2003, 4, 1), 'S10_4962', 31, Decimal('128.53'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S18_2319', 39, Decimal('106.78'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S18_2432', 45, Decimal('53.48'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S18_3232', 48, Decimal('169.34'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S18_4600', 41, Decimal('105.34'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S24_2300', 21, Decimal('102.23'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S24_2840', 24, Decimal('28.64'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S32_1268', 32, Decimal('88.61'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S32_2509', 28, Decimal('43.83'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris'),
 (172, datetime.date(2003, 4, 1), 'S700_2824', 42, Decimal('82.94'), 2003, 2, 4, '1', 'EMEA', 'France', 'Paris')]

## Roll Up

Explanation: We first know the number of product sold each month in 2003 and in EMEA

In [13]:
%%sql
select count(productCode) as saleVolume, month, year, region from
    (select * from
        (select * from fact join date_dimension using (orderDate) where year = 2003) as a 
        join 
        location_dimension using(customerNumber) where region = 'EMEA') as b group by month

 * mysql+pymysql://root:***@localhost
12 rows affected.

[(33, 1, 2003, 'EMEA'),
 (33, 2, 2003, 'EMEA'),
 (18, 3, 2003, 'EMEA'),
 (12, 4, 2003, 'EMEA'),
 (43, 5, 2003, 'EMEA'),
 (21, 6, 2003, 'EMEA'),
 (14, 7, 2003, 'EMEA'),
 (10, 8, 2003, 'EMEA'),
 (23, 9, 2003, 'EMEA'),
 (64, 10, 2003, 'EMEA'),
 (135, 11, 2003, 'EMEA'),
 (16, 12, 2003, 'EMEA')]

Then, we want to know the number of product sold each quarter instead in 2003 and in EMEA

In [14]:
%%sql
select count(productCode) as saleVolume, quarter, year, region from
    (select * from
        (select * from fact join date_dimension using (orderDate) where year = 2003) as a 
        join 
        location_dimension using(customerNumber) where region = 'EMEA') as b group by quarter

 * mysql+pymysql://root:***@localhost
4 rows affected.

[(84, 1, 2003, 'EMEA'),
 (76, 2, 2003, 'EMEA'),
 (47, 3, 2003, 'EMEA'),
 (215, 4, 2003, 'EMEA')]

## Drilldown

Explanation: We first know the sale facts of all products sold in EMEA.

In [15]:
%%sql
select * from fact join location_dimension using (customerNumber) where region = 'EMEA' order by productCode limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(353, 'S10_1678', 34, Decimal('86.13'), datetime.date(2003, 5, 7), 'EMEA', 'France', 'Reims'),
 (250, 'S10_1678', 41, Decimal('90.92'), datetime.date(2003, 7, 1), 'EMEA', 'France', 'Paris'),
 (171, 'S10_1678', 29, Decimal('76.56'), datetime.date(2003, 11, 11), 'EMEA', 'France', 'Lille'),
 (406, 'S10_1678', 41, Decimal('90.92'), datetime.date(2004, 1, 15), 'EMEA', 'France', 'Paris'),
 (119, 'S10_1678', 45, Decimal('81.35'), datetime.date(2004, 7, 23), 'EMEA', 'France', 'Nantes'),
 (186, 'S10_1678', 23, Decimal('76.56'), datetime.date(2004, 9, 30), 'EMEA', 'Finland', 'Helsinki'),
 (121, 'S10_1678', 41, Decimal('94.74'), datetime.date(2004, 10, 15), 'EMEA', 'Norway', 'Stavern'),
 (119, 'S10_1678', 21, Decimal('76.56'), datetime.date(2005, 2, 3), 'EMEA', 'France', 'Nantes'),
 (201, 'S10_1678', 24, Decimal('85.17'), datetime.date(2005, 4, 8), 'EMEA', 'UK', 'Liverpool'),
 (141, 'S10_1678', 66, Decimal('79.43'), datetime.date(2005, 5, 13), 'EMEA', 'Spain', 'Madrid')]

Explanation: Then we want to be more specific that those products are also sold in France of the EMEA region.

In [16]:
%%sql
select * from(
    select * from fact join location_dimension using (customerNumber) where region = 'EMEA' order by productCode) as 
Drilldown 
    where country = 'France' limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(406, 'S10_1678', 41, Decimal('90.92'), datetime.date(2004, 1, 15), 'EMEA', 'France', 'Paris'),
 (250, 'S10_1678', 41, Decimal('90.92'), datetime.date(2003, 7, 1), 'EMEA', 'France', 'Paris'),
 (119, 'S10_1678', 21, Decimal('76.56'), datetime.date(2005, 2, 3), 'EMEA', 'France', 'Nantes'),
 (119, 'S10_1678', 45, Decimal('81.35'), datetime.date(2004, 7, 23), 'EMEA', 'France', 'Nantes'),
 (171, 'S10_1678', 29, Decimal('76.56'), datetime.date(2003, 11, 11), 'EMEA', 'France', 'Lille'),
 (353, 'S10_1678', 34, Decimal('86.13'), datetime.date(2003, 5, 7), 'EMEA', 'France', 'Reims'),
 (256, 'S10_1949', 47, Decimal('201.44'), datetime.date(2004, 10, 11), 'EMEA', 'France', 'Versailles'),
 (146, 'S10_1949', 42, Decimal('203.59'), datetime.date(2003, 11, 25), 'EMEA', 'France', 'Lyon'),
 (119, 'S10_2016', 22, Decimal('115.37'), datetime.date(2004, 7, 23), 'EMEA', 'France', 'Nantes'),
 (250, 'S10_2016', 27, Decimal('116.56'), datetime.date(2003, 7, 1), 'EMEA', 'France', 'Paris')]